
var whoIs = prompt ('Кто ты?');
console.log(whoIs);
var howOld = prompt ('Сколько тебе годиков?');
console.log(howOld);
var shaytan = alert ('Проверим твои знания ЧОРТ?');
var easy = prompt('Даже я решу 2 + 2 = ?');
console.log(easy);
if (easy == 4){
    alert('ДА ТЫ КРАСАВЧИК!');
} else {
    alert('НУ ТЫ И НУБ! ВООБЩЕ-ТО ЭТО 4');
}

var normal = prompt('это не нормал, это изи 12 + 25 = ?');
console.log(normal);
if (normal == 37){
    alert('НАТ БЭД, НАТ БЭД!');
} else {
    alert('ДАЖЕ МОЯ БАБКА СМОГЛА БЫ РЕШИТЬ ЭТО!');
}

var hard = prompt('Уже жарче 253 + 4532 = ?');
console.log(hard);
if (hard == 4785){
    alert('НИХУАХУА, ТЫ НЕ ПЛОХ!');
} else {
    alert('ЧЕГО И СЛЕДОВАЛО ОЖИДАТЬ! ОТВЕТ 4785!');
}

var satan = alert('ЭТО ВСЁ ЧТО ТЫ МОЖЕШЬ!?');
console.log(satan);
var satan2 = alert('ТЫ НИЧТО БЕЗ КАЛЬКУЛЯТОРА!?');
console.log(satan2);
var insane = prompt('ЭТО ВООБЩЕ РЕАЛЬНО!? 2231243.2344 / 221 + 1234.2138 - 943.12456132 = ?');
console.log(insane);
if (insane == 10387.21247125919){
    alert('ТЫ ШО ЕБОБО ЧТОЛИ! ТЫ КАК ДОГАДАЛСЯ ЧОРТ!? КАЛЬКУЛЯТОР НЕБОСЬ ЮЗАНУЛ БОЛЬНОЙ УБЛЮДОК');
} else {
    alert('ТОЛЬКО Я МОГУ РЕШИТЬ ЭТОТ ПРИМЕР! ЛАДНО ПОДСКАЖУ, В ОТВЕТЕ МНОГО ЦИФР, ЛАДНО ШУЧУ ВОТ ОТВЕТ 10387.21247125919');
}
var hardcore = prompt('ЭТО ХАРДКОР ДЕТКА! 2.123124078850 * (21231.53423 + 213.12341206) - 1 = ?');
console.log(hardcore);
if (hardcore == 49756462945.58975){
    alert('ДАНИЛА ТЫ ЧТО КРЭЙЗИ!!!???');
} else {
    alert('В ЭТОР РАЗ ПРОМОЛЧУ! ОТВЕТ 49756462945,58975, И РЕШИЛ Я ЕГО В УМЕ, ДАЖЕ НЕ СПОРЬ СО МНОЙ!');
}
var godlike = prompt('OHHH RAMPAAGEEE!!! 214132412369679.324289235 - 12466289.4531324 + 39618.212 + 12345683 * (666.666.666 + 666.666.666) = ?');
console.log(godlike);
if (godlike == 2.688881705483604e+24){
    alert('o_O o_O o_O');
} else {
    alert('НЕ БУДУ ГЛУМИТЬСЯ НАД ТОБОЙ, СКАЖУ ЧЕСТНО РЕШИЛ ЕГО НА КАЛЬКУЛЯТОРЕ (ТОЛЬКО ЕГО), ВОТ ОТВЕТ 2,688881705483604e+24');
}
var satan3 = alert('КАК ТЕБЕ ТАКОЕ ИЛОН МАСК?');
var result = ('Ну чтож ' + whoIs + ' посмооотрим, ответ на первый пример ' + easy + ', что там со вторым ' + normal + ', с третьим как дела обстоят ' + hard + ', а что там по безумию? ' + insane + '. Что по хардкору? ' + hardcore + '. Ну и самое сладенькое напоследок ' + godlike + ', наврятли ты отгадал)0))' + ' мдаааа, твой возраст оправдывает твои знания, а ну звиздуй обратно в школу, школотрон, извинитесь');
alert(result);





